<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"becc16b601e9f5699b69e6f0d90735bba900b6a2dc1d0f74db70d68e970078db","plan_job_ref":"Job Staging Image Build & Push #24 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7359372555","plan_hash":"d3576b02a92128c4b1d1fa767eb4d08fadfdcd1251d13194930a3cea68359946","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:22" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:22" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
!~                  cpu          = 500 -> 250
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:99c950ca8910c47d6e2227875a1b279a5aef2656" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:d7b2a4513e68606ee5c4995eb4d87f46728e5881"
!~                  memory       = 1024 -> 500
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (1 unchanged attribute hidden)
                },
            ] # forces replacement
        )
!~      cpu                      = "1024" -> "250" # forces replacement
!~      id                       = "*********************" -> (known after apply)
!~      memory                   = "2048" -> "500" # forces replacement
!~      revision                 = 22 -> (known after apply)
-       tags                     = {} -> null
#        (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #24](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7359372555)